package java1.day08;

public class SportsCar {

}

class Tire{
	
}



/*

	객체와 클래스
		-객체를 생성할 때에는 설계도/클래스 가 필요하다.
		
		개발자 --클래스 생성--> 클래스
		클래스 --인스턴스화-- > 

		-클래스 사용 목적
			1. 객체를 생성하기 위한 설계도
			2. 객체를 만들지 않더라도 실행할 목적
			3. MVC(모델-뷰-컨트롤러)(사용자 인터페이스, 데이터 및 논리 제어를 구현하는데 널리 사용되는 소프트웨어 디자인 패턴)
			각 코드역할분담

		- 클래스 선언
			- 구성
				1. 어떻게 객체를 생성(생성자) : 객체 생성시 초기값을 담당하는 메소드
				2. 가져야 할 데이터(필드) : 객체의 상태/속성, 주로 변수와 동일하게 생김
				3. 객체의 행동(메소드) : 객체의 행동/이벤트
				
		- 객체 선언
			클래스명 변수명 = new 생성자();
			ex) Scanner scanner = new Scanner(System.in);








*/