/*
	1. 주석
		1) 한줄 주석 : //
		2) 여러줄 주석 : / 별별 /
	2. 출력 함수
		1) console.log('') : F12 개발자도구 console 탭 출력되는 함수  //잘써야 된다 중요함
		2) alert('하고싶은말'): 알람 메시지 '확인' 만 출력하는 함수
		3) confirm('하고싶은말'): 알람 메시지 확인 + 취소 두개 출력하는 함수
		4) prompt('하고싶은말') : 입력 메세지 칸 생성됨
	3. 데이터 자료형
		1. 문자	: ' ' || " "
		2. 숫자	: 200 // 그냥 적어
		3. 논리	: ture || false

*/


// 1. 출력
console.log('안녕 스크립트')	// 문자 입력시 ' ' 사용
console.log("안녕 스크립트")	// 문자 입력시 " " 사용
console.log(200)			// 숫자는 문자처리 안 함 / 바로 출력 됨
console.log("200")			// " " 안에 들어가면 문자로 인식
console.log(true)			// 논리형
console.log(20+"개")			// 문자 + 숫자 (연결 연산자) 문자랑 숫자 섞이면 문자로 인식함

// 2. 출력
alert('안녕 js')	// 얘는 확인 버튼만 있음
alert(20 + 20)	// 숫자 + 숫자 (더하기 연산자) 
alert("20" + 20)	// 2020 출력

// 3. 출력
confirm('컨펌 js') // 알람창에 확인 취소 두개

// 4. 입력
prompt('입력 js') // 알람창에 입력까지 //안써






